# *************** импорт модулей ***************
import math
import random
import Modules.moda as moda

# *************** работа с библиотекой math ***************
print('# *************** работа с библиотекой math ***************')
r = 100
print(f'Длина окружности радиуса {r} = {2*r*math.pi}')
print(f'\nПлощадь круга радиуса {r} = {math.pi*r**2}')
# либо через функцию возведения в степень
print(f'\nПлощадь круга радиуса {r} = {math.pi*math.pow(r, 2)}')

# расстояние между точками, заданными координатами
x1 = 10
y1 = 10
x2 = 50
y2 = 100
l = math.sqrt((x1-x2)**2+(y1-y2)**2)
print(f'\nРасстояние между точками = {l}')

# факториал числа
n = 9
print(f'\nФакториал числа {n} = {math.factorial(n)}')

# *************** работа с библиотекой random ***************
print('\n\n*************** работа с библиотекой random ***************')
print(f'\nСлучайное число в диапазоне 0 100: {random.randint(0, 100)}')

# работа с последовательностью
players = ['Max', 'Leo', 'Kate', 'Ron', 'Bill']
print(f'\nСлучайный элемент последовательности: {random.choice(players)}')

print(f'\nНасколько случайных элементов последовательности {random.sample(players, 3)}')

cards = ['6', '7', '8', '9', '10', 'T', 'J', 'Q', 'K', 'A']
print(f'\nИсходный список {cards}')
random.shuffle(cards)
print(f'\nИзмененный список {cards}')

# *************** работа с модулями ***************
print('\n\n*************** работа с модулями ***************')
moda.bar('Test modules')
